archive/backup/git-cheat-sheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-09-14 Mon 08:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Cheat Sheet</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="kiran" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Git Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Writing good git commit messages</a></li>
<li><a href="#orgheadline2">2. Git Commands</a></li>
<li><a href="#orgheadline5">3. Magit</a>
<ul>
<li><a href="#orgheadline3">3.1. Setup Magit</a></li>
<li><a href="#orgheadline4">3.2. magit cheat sheet</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr  />

<ul class="org-ul">
<li>Some git commands I find myself looking up over and over again.</li>
</ul>

<hr  />

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Writing good git commit messages</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://chris.beams.io/posts/git-commit/">http://chris.beams.io/posts/git-commit/</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Git Commands</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
Set remote origin URL 
</p>
<div class="org-src-container">

<pre class="src src-sh">git remote set-url origin &lt;git url.git&gt;
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li>Remove file already being tracked by git</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">git rm --cached &lt;file&gt;
</pre>
</div>


<ul class="org-ul">
<li>Ignore file with certain extension

<ul class="org-ul">
<li>Add to .gitignore. (ex: *.pyc)</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">3</span> Magit</h2>
<div class="outline-text-2" id="text-3">
<p>
If you use emacs &amp; you use git, I haven't found a better tool than magit.
Magit is git interface for emacs so you can edit the code, check it into git
and push upstream without ever leaving the editor.
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> Setup Magit</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><p>
Easiest way is to use the built in package manager.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; magit
M-x package-install RET magit RET
(require 'magit)
</pre>
</div></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> magit cheat sheet</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><p>
invoke magit buffer 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">M-x g
</pre>
</div></li>

<li><p>
refresh magit buffer
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">g
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li><p>
Capital S to stage everything under changes
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">S
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li><p>
commit
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">c
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li><p>
Type log message in open buffer &amp; enter:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">C-c C-c
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li><p>
push changes
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">P   ; push changes
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li><p>
If magit keeps firing up a new window
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-variable 'magit-emacsclient-executable "&lt;path_to_emacs_client&gt;")
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
